{"posts":[{"no":3898499,"now":"10\/30\/19(Wed)20:10:41","name":"Chapter 34: Ignition","sub":"Necromancer Detective 46","com":"Everything is not awesome. In fact, things are probably the worst they&#039;ve been since that fight with Del Mar. The town led by the Cult of Progress just asplooded, an archangel just got the shit beaten out of her, and the biggest baddest enemy yet just emerged from the charred and lightning encrusted wreckage of the town. Don&#039;t worry, you got this.<br><br>Quest rules:<br>1. All dice rolled are assumed to be D100 unless otherwise stated<br>2. The first two rolls will be given far greater importance, but additional rolls, good or bad, will affect the outcome. This choice ultimately falls to the Lorekeeper, odd circumstances may cause him to change how the story progresses (a ton of crits for instance)<br>3. All dice rolls are final<br>4. Critical fails are considered to be between 1-5, Critical hits are between 95-100. Crits overpower any other roll except another crit. In the rare chance that a crit fail and crit success happen. The Lorekeeper will do something interesting from a story angle. Similarly, rolling 2 of the same number will be considered a MEGA crit, just pray its two high numbers. <br>5. Near misses may occur, where a rolled number is close to the required threshold, whether over or under. This can have an impact on how the story proceeds. However these are up to the decision of the Lorekeeper.<br>6. Sometimes there are optional choices one may participate in, these will generally NOT be taken unless there are multiple posters who wish it, assuming there are multiple posters in the thread<br>7. There are often times choices with multiple parts, each part is counted separately, unless otherwise stated, sometimes rolls will be required before counting the second, third, etc, part<br>8. There will be “Time Limited” decisions, in which characters may only do a set number of actions, these will be clearly marked. Generally you will only be able to choose one decision per ‘round’.<br>9. Rules may be subject to change between threads, but will not change during the same thread. These rules are what we will follow for the remainder of this thread.<br><br>Archived Threads + Sidequests: http:\/\/suptg.thisisnotatrueending.c<wbr>om\/qstarchive.html?tags=Necromancer<wbr>+Detective+Quest<br><br>Discord (Meet the Loremaster himself, and get live updates and all that jazz): https:\/\/discord.gg\/5sZYkz9 (HIGHLY RECOMMENDED)<br><br>Main Character Spell List: <br>https:\/\/pastebin.com\/raw\/PHc7TmBN<br><br>Equipment List<br>https:\/\/pastebin.com\/raw\/w7WUxyK6","filename":"2y3abf","ext":".jpg","w":800,"h":450,"tn_w":250,"tn_h":140,"tim":1572480641125,"time":1572480641,"md5":"yik+Un6IkWRMGTSBt5SwZA==","fsize":41280,"resto":0,"id":"GFfynH2b","bumplimit":0,"imagelimit":0,"semantic_url":"necromancer-detective-46","custom_spoiler":0,"replies":11,"images":1,"unique_ips":7},{"no":3898503,"now":"10\/30\/19(Wed)20:11:32","name":"Lorekeeper","com":"<a href=\"#p3898499\" class=\"quotelink\">&gt;&gt;3898499<\/a><br><span class=\"quote\">&gt;from prior thread<\/span><br><br>As the carriage drew around the final bend, Henry’s excitement turned to confusion and then horror. He could see flames leaping up from the town as well as angelic magic being fired off at the forces on the ground. There were troops swarming over the place although he couldn’t tell who. This was bad, very bad, extremely bad.<br><br>As everything came to a head, a massive explosion shook the entire countryside. Trees were flung about like toothpicks near the town as buildings were flung about like toys. The shockwave spooked the horses and the carriage was flung into a ditch. Larry and Ophelia were thrown off the back while the driver was dashed against some rocks. The interior was a mess Rosa, Charles, and Henry were flung about amongst broken glass and shattered wood. Xavier landed behind the cart gracefully as he could managed, the only one to avoid any real trouble.<br><br>Henry kicked out the door and lifted Charles out, then gave assistance to Rosa.<br><br>“Holy shit.” Larry muttered, fear in his voice for the first time that day.<br><br>Henry spun around to find something unbelievable. Something terrifying. In the fading light, a massive spirit, towering over the nearby town, and standing level with the nearby hills. A massive being of red mana, something that looked like a giant ghiest tore up the countryside as the angels around ducked and weaved out of the way. Henry felt himself become paralyzed for a moment as he watched Rosa rush off thoughtlessly to try and save the driver.<br><br>“God protect us.” Xavier muttered.<br><br>Henry watched as an angel, what he believed to be an archangel, stand before the creature. The archangel cast a massive spell, using up tremendous amounts of white mana, forming a holy sword of pure light. The sword was big enough to cut the creature in twain. The sword slammed down into the beast, which managed to knock it away as pieces of itself came loose, turning into bouts of lighting and flame. The thing shrieked, then swatted the archangel away into a nearby hill, causing the earth itself to shake.<br><br>Henry watched as white mana trailed out of the hill in the form of a barrier as the archangel tried to get airborne. One final, tremendous punch put an end to any hope of resistance as the hillside was torn off by the force.<br><br>The beast, leaned over the destroyed hill, and great bouts of fire and lightning emerged from its maw as it scorched the earth. The creature than began lumbering off, ignoring the angels buzzing around it and the scattered forces on the ground.<br><br>The town had gone boom.<br><br>=================================(E<wbr>nd of Chapter)===========================<wbr>========","filename":"1572479441612","ext":".jpg","w":417,"h":305,"tn_w":125,"tn_h":91,"tim":1572480692716,"time":1572480692,"md5":"jeLocKJzHO0aRc7t8Wau8Q==","fsize":69643,"resto":3898499,"id":"GFfynH2b"},{"no":3898511,"now":"10\/30\/19(Wed)20:14:13","name":"Anonymous","com":"<a href=\"#p3898503\" class=\"quotelink\">&gt;&gt;3898503<\/a><br>Uh.<br><br>Did we get paid yet? Because that will influence my choices.","time":1572480853,"resto":3898499,"id":"HsyCXZYv"},{"no":3898566,"now":"10\/30\/19(Wed)20:40:33","name":"Chapter 34: Ignition","com":"“Never forget that scientific progress requires the sacrifices of those both willing and innocent. Progress makes no distinctions between sinners and saints. Thus it is fair. It cares little for whose blood oils its gears, and whose hands turn its wheels.” ~ Marquis Ludvig Von Braun<br><br>===================================<wbr>(Chapter Start)=============================<wbr>=========<br><br><br>Henry stood slack jawed. Xavier fell backwards, tripping over a piece of the carriage as the world continued to shake and the beasts shrieks continued to resound through the valley. Henry watched as particles and pieces of mana shot off of the creature, impacting the countryside and spreading fire and destruction wherever they touched down. Every time it happened, the beat shrunk down. Eventually the creature disappeared behind a hillside as the angelic procession gave pursuit. Henry stood there for a moment, wondering what the hell had just happened. <br><br>Decisions:<br>1. *try to snap everyone back to attention*<br>2. *thank whoever the fuck is up in the clouds for not killing you*<br>3. *lose spaghetti* <br>4. (write in)","time":1572482433,"resto":3898499,"id":"GFfynH2b"},{"no":3898571,"now":"10\/30\/19(Wed)20:43:40","name":"Lorekeeper","com":"<a href=\"#p3898566\" class=\"quotelink\">&gt;&gt;3898566<\/a><br>I might as well mention that the sun is about to go down.","time":1572482620,"resto":3898499,"id":"GFfynH2b"},{"no":3898596,"now":"10\/30\/19(Wed)20:54:52","name":"Anonymous","com":"<a href=\"#p3898566\" class=\"quotelink\">&gt;&gt;3898566<\/a><br>Yo.<br><br>Did.<br><br>We.<br><br>Get.<br><br>Paid.","time":1572483292,"resto":3898499,"id":"HsyCXZYv"},{"no":3898611,"now":"10\/30\/19(Wed)21:05:19","name":"Lorekeeper","com":"<a href=\"#p3898596\" class=\"quotelink\">&gt;&gt;3898596<\/a><br>not yet","time":1572483919,"resto":3898499,"id":"GFfynH2b"},{"no":3898625,"now":"10\/30\/19(Wed)21:11:06","name":"Anonymous","com":"<a href=\"#p3898611\" class=\"quotelink\">&gt;&gt;3898611<\/a><br><a href=\"#p3898566\" class=\"quotelink\">&gt;&gt;3898566<\/a><br>Henry&#039;s first thought should be<br><span class=\"quote\">&gt;Oh god oh fuck<\/span><br>Henry&#039;s second thought should be<br><span class=\"quote\">&gt;Get me plus everybody else to closest safety<\/span><br>Henry&#039;s third thought should be<br><span class=\"quote\">&gt;Fuck, I did not get paid yet, damn you giant monster thing<\/span><br>And then<br><span class=\"quote\">&gt;*try to snap everyone back to attention*<\/span>","time":1572484266,"resto":3898499,"id":"GgpcYKD5"},{"no":3898645,"now":"10\/30\/19(Wed)21:17:44","name":"Anonymous","com":"<a href=\"#p3898625\" class=\"quotelink\">&gt;&gt;3898625<\/a><br>This, followed by evacuating survivors.<br><br>Sure as fuck ain&#039;t gonna fight while Angels have it under control","time":1572484664,"resto":3898499,"id":"mYxoBCDg"},{"no":3899334,"now":"10\/31\/19(Thu)09:27:22","name":"Lorekeeper","com":"<a href=\"#p3898625\" class=\"quotelink\">&gt;&gt;3898625<\/a><br><a href=\"#p3898645\" class=\"quotelink\">&gt;&gt;3898645<\/a><br>roll 1d100","time":1572528442,"resto":3898499,"id":"QWQUfQst"},{"no":3899335,"now":"10\/31\/19(Thu)09:31:24","name":"Anonymous","com":"<b>Rolled 27 (1d100)<br><br><\/b><a href=\"#p3899334\" class=\"quotelink\">&gt;&gt;3899334<\/a>","time":1572528684,"resto":3898499,"id":"LIGXncX8"},{"no":3899544,"now":"10\/31\/19(Thu)12:40:07","name":"Anonymous","com":"<b>Rolled 12 (1d100)<br><br><\/b><a href=\"#p3899334\" class=\"quotelink\">&gt;&gt;3899334<\/a>","time":1572540007,"resto":3898499,"id":"OcbMrljz"}]}